<template>
    <div class="reg-modals contractModal modal fade" id="contractModal" tabindex="-1" aria-labelledby="exampleModalLabel" aria-hidden="true">
        <div class="modal-dialog">
            <div class="modal-content text-start">
                <!-- عقد عمل مع مؤسسة ورقة -->
                <div v-if="tab == 0">
                    <header class="b-color-2 f-color-0 py-3 px-4 d-flex justify-content-between">
                        <h4 class="m-0">عقد عمل مع مؤسسة ورقة.</h4>
                        <button type="button" class="f-color-0 border-0 background-none" data-bs-dismiss="modal" aria-label="Close"><i class="fas fa-times"></i></button>
                    </header>
                    <div class="mt-3 px-3 px-md-5 py-5">
                        <article class="f-color-2">
                            <h4 class="text-center mb-5">بسم الله الرحمن الرحيم</h4>
                            <p>يسر مؤسسة ورقة لتعليم القرآن الكريم واللغة العربية والدراسات الإسلامية انضمامك إلى فريقنا سائلين المولى سبحانه أن نكون عونا على الخير وأن يستخدمنا فيما يرضيه.</p>
                            <p>ولإتمام خطوات الانضام يرجى قراءة البيانات التالية ومراجعتها بدقة، علما بأنك ستحتاج إلى المستندات التالية:</p>
                            <p>١ - صورة عن البطاقة الشخصية أو جواز السفر. <br>.٢ - صور عن الوثائق والشهادات العلمية <br> ٣ - للرجال: صورة فوتوغرافية واضحة، ويمكن للنساء إرفاق صورة اختياريا. <br>٤ - السيرة الذاتية.</p>
                            <p>أذكرك أن تستخير الله قبل أن تقدم على هذه الخطوة وأن تسأله التوفيق,<br>نحن في انتظارك ومتطلعون للتعاون معك بإذن الله,<br>دمت في رعاية الله وأمنه.<br>ورقة</p>
                            <p></p>
                        </article>
                        <footer class="d-flex justify-content-end">
                            <button class="border-0 main-button-style f-color-0 py-2 px-3 rounded" @click="tab++">التالي</button>
                        </footer>
                        
                    </div>
                </div>
                <!-- بنود العقد -->
                <div v-if="tab == 1">
                    <header class="b-color-2 f-color-0 py-3 px-4 d-flex justify-content-between">
                        <h4 class="m-0">بنود العقد.</h4>
                        <button type="button" class="f-color-0 border-0 background-none" data-bs-dismiss="modal" aria-label="Close"><i class="fas fa-times"></i></button>
                    </header>
                    <div class="mt-3 px-3 px-md-5 py-5">
                        <article class="f-color-2">
                            <span>الطرف الأول: مؤسسة ورقة.</span>
                            <div>
                                <span>الطرف الثاني: </span>
                                <span> {{name}}</span>
                                <!-- <div class="col-6">
                                    <input type="text" class="form-control" placeholder="ادخل إسمك" required>
                                </div> -->
                            </div>
                            <!-- Paragraphs -->
                            <div class="content my-5">
                                <p>وقد اتفق الطرفان على ما يلي:</p>
                                <p>يعمل الطرف الثاني لدى الطرف الأول بمهنة معلم نظير مبلغ مالي وقدره ستون جنيها لا غير بالجنية المصري بواقع أربعون جنيها للدرس وعشرون جنيها أجر تسليم تقرير الدرس عن كل ساعة تحتسب عند تسليم التقرير في أول 24 ساعة من انتهاء وقت الدرس وأن يلتزم الطرف الثانى بتوفير ساعات العمل المطلوبة حتى يتم احتساب الوقت بفاعلية. كما أنه فى حال التدريس ينطبق عليه شروط المعلم وهى كما يلى:</p>
                                <p>أ - يلتزم الطرف الثانى بتقديم جميع البيانات الخاصة التى تطلب منه حتى نتمكن من تحويل الراتب.</p>
                                <p>ب - يلتزم الطرف الثانى بالاشتراك فى خدمة انترنت قوية ومميزة حتى يكون تواصل المعلم مع الطالب أثناء الحصة مفيدا.</p>
                                <p>ج- في حال ضعف الإنترنت عند المعلم مما يترتب عليه إلغاء الدرس او إعادته لا يتم محاسبة المعلم على الدرس.</p>
                                <p>د- فى حال تكرار الشكوى من ضعف الانترنت بسبب ضعف الاشتراك أكثر من مرة خلال الشهر الواحد يتم غلق جدول المعلم وهذا يعنى وقف تسجيل طلاب جدد ويتم سحب الطلاب من عند المعلم بواقع طالب كل يوم حتى يلتزم الطرف الثانى بتحضير الدروس وعدم التسبب في أي أذى نفسي أو بدني للطالب وحضور الاجتماعات الجانبية عند طلب الطرف الأول الاجتماع به وهي خارج إطار البند رقم ١ وعليه الالتزام بالحضور في الوقت المحدد من قبل الطرف الأول ويتم التنسيق مع الطرف الثاني لتحديد الموعد المناسب للقاءات والتباحث في قضايا العمل.</p>
                                <p>هـ- يلتزم الطرف الثاني باستخدام الوقت بفاعلية تامة وأن ينجز الأعمال المناطة به في أقرب وقت وعدم التأخر في إنجاز الأعمال يلتزم الطرف الثاني بتطبيق معايير الجودة وسرعة الانجاز والالتزام بكافة التعليمات والتنظيمات المباشره من رئاسة القسم الذي يعمل به.</p>
                                <p>و - يلتزم الطرف الثاني بعدم الاحتفاظ بأي ارقام او اي طريقة تواصل سواء ايميل او التواصل عن طريق وسائل التواصل الاجتماعي او اي وسيلة اخرى مع عملاء الشبكة وعدم تداول هذه المعلومات إلا لمصلحة الطرف الأول وموافقته على ذلك.</p>
                                <p>ز - يلتزم الطرف الأول بدفع مستحقات الطرف الثاني في الأسبوع الأول من بداية الشهر.</p>
                                <p>ح - يصبح هذا العقد ملغيا بدون تعويض أو مكافاة فيما ارتكب الطرف الثاني احد الامور الموجبة لإلغاء العقد وهي: إفشاء أسرار العمل, التحدث مع العملاء خارج موضوع العمل المنوط بالطرف الثاني اداؤه, التعاقد الباطن مع العملاء المباشرين, أخذ أي مبلغ مادي من العملاء, الإخلال بالآداب الإسلامية , التعدي اللفظي أو الجسدي على العملاء أو العاملين في الشبكة, التخلف عن ساعات العمل المطلوبة وعدم إنجاز الأعمال بالشكل المطلوب والمحدد.</p>
                                <p>ط - يتعهد الطرف الثاني بعدم إفشاء الأسرار الخاصة بالمؤسسة وآلية العمل لأي طرف حتى على سبيل المساعدة.</p>
                                <p>ي - يتعهد الطرف الثاني بعدم الخوض في أي أمور مادية تتعلق باتفاقيات المؤسسة الخاصة او العامة مع أي طرف.</p>
                                <p>ك - تعتبر الأشهر الثلاثة الأولى فترة اختبار يظهر فيها الطرف الثاني جدية العمل والالتزام بما تم الاتفاق عليه.</p>
                                <p>ل - يحق للطرف الأول تسريح الطرف الثاني في حالة وجوب التسريح الناتج عن ضعف أداء الطرف الثاني، و يتم التسريح وفقا للآلية التالية، يدفع الطرف الأول للطرف الثاني كافة مستحقاته المتفق عليها في العقد ويتم التسريح بدون أي قيود أو شروط تترتب على الطرف الأول تحملها.</p>
                                <p>م - اجازة عيد الفطر 3 أيام، إجازة عيد الأضحى ٥ أيام، ما لم يتم تعديل ذلك من قبل الطرف الأول وفقا لمصلحة العمل.</p>
                                <p>ن - يحق للطرف الثاني إجازة سنوية لمدة ١٤ يوم فقط , ويجب توفر البديل للقيام بعمله عند تمتعه بالإجازة، ولا يستحق الحصول عليها إلا بعد مرور ١٢ شهرا من أول تعاقد مع الطرف الأول، علما أنه لا يمكن جمع إجازة سنوية بأخرى في سنة واحدة.</p>
                                <p>س - مدة هذا العقد سنتان من بداية التعاقد.</p>
                                <p>ع - حرر هذا العقد من نسختين ترسل عن طريق البريد الإلكتروني لكل من المتعاقدين.</p>
                            </div>
                        </article>
                        <footer class="d-flex justify-content-end">
                            <button class="border-0 b-color-2 f-color-0 py-2 px-3 rounded mx-3" @click="tab--">العودة</button>
                            <!-- <button class="border-0 main-button-style f-color-0 py-2 px-3 rounded" @click="tab++">التالي</button> -->
                        </footer>
                        
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    props:['name'],
    data(){
        return {
            tab: 0
        }
    }
}
</script>
<style>
@media (min-width: 576px){
    .reg-modals .modal-dialog {
        max-width: 70%;
    }
}
.contractModal .modal-content{
    font-family: El Messiri,sans-serif;
    text-align: right !important;
    direction: rtl;
}
.reg-modals .content{
    height: 450px;
    overflow-y: auto;
}
.reg-modals .content::-webkit-scrollbar {
    width: 4px;
}
.reg-modals .content::-webkit-scrollbar-thumb {
    background: var(--color-1);
}
</style>
